src/Documents/ПередачаТоваровХранителю.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПередачаТоваровХранителю</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаказКлиента</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСКлиентами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Номенклатура</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/ИС_МП_Печать/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

//+ ИнфоСофт Стояк Ю.К. 29.10.2024 УА #67816
Функция ТекстЗапросаПараметровПечатиШтрихкодов() Экспорт
	
	Текст = "
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказКлиента.Ссылка КАК Заказ1С,
	|	ЗаказКлиента.Дата КАК ДатаЗаказ1С,
	|	ЗаказКлиента.Автор КАК АвторЗаказ1С,
	|	ЗаказКлиента.Организация КАК ОрганизацияЗаказ1С,
	|	ЗаказКлиента.Менеджер КАК ОтветственныйЗаказ1С,
	|	ЗаказКлиента.ДатаОтгрузки КАК ДатаОтгрузкиЗаказ1С,
	|	ЗаказКлиента.Номер КАК НомерЗаказ1С,
	|	ЗаказКлиента.Комментарий КАК КомментарийЗаказ1С
	|ПОМЕСТИТЬ ВТ_ДанныеЗаказа
	|ИЗ
	|	ВТ_ДанныеМаркетплейса КАК ВТ_ДанныеМаркетплейса
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиента
	|		ПО ВТ_ДанныеМаркетплейса.Заказ = ЗаказКлиента.Ссылка
	|ГДЕ
	|	НЕ ЗаказКлиента.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеЗаказа.Заказ1С КАК Заказ1С,
	|	ПередачаТоваровХранителю.Ссылка КАК Реализация
	|ПОМЕСТИТЬ ВТ_РеализацииССылка
	|ИЗ
	|	ВТ_ДанныеЗаказа КАК ВТ_ДанныеЗаказа
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровХранителю КАК ПередачаТоваровХранителю
	|		ПО ВТ_ДанныеЗаказа.Заказ1С = ПередачаТоваровХранителю.ЗаказКлиента
	|			И (НЕ ВТ_ДанныеЗаказа.Заказ1С = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка))
	|ГДЕ
	|	НЕ ВТ_ДанныеЗаказа.Заказ1С = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|	И НЕ ПередачаТоваровХранителю.Ссылка ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_ДанныеЗаказа.Заказ1С,
	|	ПередачаТоваровХранителюТовары.Ссылка
	|ИЗ
	|	ВТ_ДанныеЗаказа КАК ВТ_ДанныеЗаказа
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровХранителю.Товары КАК ПередачаТоваровХранителюТовары
	|		ПО ВТ_ДанныеЗаказа.Заказ1С = ПередачаТоваровХранителюТовары.ЗаказКлиента
	|			И (НЕ ВТ_ДанныеЗаказа.Заказ1С = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка))
	|ГДЕ
	|	НЕ ВТ_ДанныеЗаказа.Заказ1С = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|	И НЕ ПередачаТоваровХранителюТовары.Ссылка ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_ДанныеЗаказа.Заказ1С,
	|	РеализацияТоваровУслуг.Ссылка 
	|ИЗ
	|	ВТ_ДанныеЗаказа КАК ВТ_ДанныеЗаказа
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО ВТ_ДанныеЗаказа.Заказ1С = РеализацияТоваровУслуг.ЗаказКлиента
	|			И (НЕ ВТ_ДанныеЗаказа.Заказ1С = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка))
	|ГДЕ
	|	НЕ ВТ_ДанныеЗаказа.Заказ1С = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|	И НЕ РеализацияТоваровУслуг.Ссылка ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_ДанныеЗаказа.Заказ1С,
	|	РеализацияТоваровУслугТовары.Ссылка
	|ИЗ
	|	ВТ_ДанныеЗаказа КАК ВТ_ДанныеЗаказа
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|		ПО ВТ_ДанныеЗаказа.Заказ1С = РеализацияТоваровУслугТовары.ЗаказКлиента
	|			И (НЕ ВТ_ДанныеЗаказа.Заказ1С = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка))
	|ГДЕ
	|	НЕ ВТ_ДанныеЗаказа.Заказ1С = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|	И НЕ РеализацияТоваровУслугТовары.Ссылка ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РеализацииССылка.Реализация КАК Реализация1С,
	|	ВТ_РеализацииССылка.Реализация.Номер КАК НомерРеализация1С,
	|	ВТ_РеализацииССылка.Реализация.Дата КАК ДатаРеализация1С,
	|	ВТ_РеализацииССылка.Реализация.Комментарий КАК КомментарийРеализация1С,
	|	ВТ_РеализацииССылка.Реализация.Менеджер КАК ОтветственныйРеализация1С,
	|	ВТ_РеализацииССылка.Реализация.Автор КАК АвторРеализация1С,
	|	ВТ_ДанныеЗаказа.Заказ1С КАК Заказ1С,
	|	ВТ_ДанныеЗаказа.ДатаЗаказ1С КАК ДатаЗаказ1С,
	|	ВТ_ДанныеЗаказа.АвторЗаказ1С КАК АвторЗаказ1С,
	|	ВТ_ДанныеЗаказа.ОрганизацияЗаказ1С КАК ОрганизацияЗаказ1С,
	|	ВТ_ДанныеЗаказа.ОтветственныйЗаказ1С КАК ОтветственныйЗаказ1С,
	|	ВТ_ДанныеЗаказа.ДатаОтгрузкиЗаказ1С КАК ДатаОтгрузкиЗаказ1С,
	|	ВТ_ДанныеЗаказа.НомерЗаказ1С КАК НомерЗаказ1С,
	|	ВТ_ДанныеЗаказа.КомментарийЗаказ1С КАК КомментарийЗаказ1С
	|ПОМЕСТИТЬ ВТ_ДанныеЗаказаИРеализации
	|ИЗ
	|	ВТ_ДанныеЗаказа КАК ВТ_ДанныеЗаказа
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РеализацииССылка КАК ВТ_РеализацииССылка
	|		ПО ВТ_ДанныеЗаказа.Заказ1С = ВТ_РеализацииССылка.Заказ1С
	|ГДЕ
	|	НЕ ВТ_РеализацииССылка.Реализация.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Номенклатура.Наименование КАК НаименованиеНоменклатуры1С,
	|	Номенклатура.Артикул КАК АртикулНоменклатуры1С,
	|	Номенклатура.Производитель КАК ПроизводительНоменклатуры1С,
	|	Номенклатура.СрокГодности КАК СрокГодностиНоменклатуры1С,	
	|	Номенклатура.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_ДанныеНоменклатуры
	|ИЗ
	|	ВТ_ДанныеМаркетплейса КАК ВТ_ДанныеМаркетплейса
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО ВТ_ДанныеМаркетплейса.Номенклатура1С = Номенклатура.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////  
	
	//+ ИнфоСофт Заварин К.В. 10.12.24 УА #89316
	//|ВЫБРАТЬ 
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//- ИнфоСофт Заварин К.В. 10.12.24 УА #89316	
	|	ВТ_ДанныеМаркетплейса.НомерЗаказаСМаркетплейса КАК НомерЗаказаСМаркетплейса,
	|	ВТ_ДанныеМаркетплейса.КодНоменклатурыСМаркетплейса КАК КодНоменклатурыСМаркетплейса,
	|	ВТ_ДанныеМаркетплейса.Дата КАК Дата,
	|	ВТ_ДанныеМаркетплейса.АртикулПоставщикаНоменклатурыСМаркетплейса КАК АртикулПоставщикаНоменклатурыСМаркетплейса,
	|	ВТ_ДанныеМаркетплейса.РазмерСВБ КАК РазмерСВБ,
	|	ВТ_ДанныеМаркетплейса.ЦветСВБ КАК ЦветСВБ,
	|	ВТ_ДанныеМаркетплейса.ШтрихкодСМаркетплейса КАК ШтрихкодСМаркетплейса,
	|	ВТ_ДанныеМаркетплейса.НаименованиеНоменклатурыСМаркетплейса КАК НаименованиеНоменклатурыСМаркетплейса,
	|	ВТ_ДанныеМаркетплейса.Номенклатура1С КАК Номенклатура1С,
	|	ВТ_ДанныеМаркетплейса.Характеристика1С КАК Характеристика1С,
	//+ ИнфоСофт Заварин К.В. 27.12.24 УА #90269
	|	МАКСИМУМ(ВТ_ДанныеЗаказаИРеализации.Реализация1С) КАК Реализация1С,
	|	МАКСИМУМ(ВТ_ДанныеЗаказаИРеализации.НомерРеализация1С) КАК НомерРеализация1С,
	|	МАКСИМУМ(ВТ_ДанныеЗаказаИРеализации.ДатаРеализация1С) КАК ДатаРеализация1С,
	|	МАКСИМУМ(ВЫРАЗИТЬ(ВТ_ДанныеЗаказаИРеализации.КомментарийРеализация1С КАК СТРОКА(1000))) КАК КомментарийРеализация1С,
	|	МАКСИМУМ(ВТ_ДанныеЗаказаИРеализации.ОтветственныйРеализация1С) КАК ОтветственныйРеализация1С,
	|	МАКСИМУМ(ВТ_ДанныеЗаказаИРеализации.АвторРеализация1С) КАК АвторРеализация1С,
	//- ИнфоСофт Заварин К.В. 27.12.24 УА #90269
	|	ВТ_ДанныеЗаказаИРеализации.Заказ1С КАК Заказ1С,
	|	ВТ_ДанныеЗаказаИРеализации.ДатаЗаказ1С КАК ДатаЗаказ1С,
	|	ВТ_ДанныеЗаказаИРеализации.АвторЗаказ1С КАК АвторЗаказ1С,
	|	ВТ_ДанныеЗаказаИРеализации.ОрганизацияЗаказ1С КАК ОрганизацияЗаказ1С,
	|	ВТ_ДанныеЗаказаИРеализации.ОтветственныйЗаказ1С КАК ОтветственныйЗаказ1С,
	|	ВТ_ДанныеЗаказаИРеализации.ДатаОтгрузкиЗаказ1С КАК ДатаОтгрузкиЗаказ1С,
	|	ВТ_ДанныеЗаказаИРеализации.НомерЗаказ1С КАК НомерЗаказ1С,
	//+ ИнфоСофт Заварин К.В. 10.12.24 УА #89316
	//|	ВТ_ДанныеЗаказаИРеализации.КомментарийЗаказ1С КАК КомментарийЗаказ1С, 
	|	ВЫРАЗИТЬ(ВТ_ДанныеЗаказаИРеализации.КомментарийЗаказ1С КАК СТРОКА(1000)) КАК КомментарийЗаказ1С,
	//- ИнфоСофт Заварин К.В. 10.12.24 УА #89316
	|	ВТ_ДанныеНоменклатуры.НаименованиеНоменклатуры1С КАК НаименованиеНоменклатуры1С,
	|	ВТ_ДанныеНоменклатуры.АртикулНоменклатуры1С КАК АртикулНоменклатуры1С,
	|	ВТ_ДанныеНоменклатуры.ПроизводительНоменклатуры1С КАК ПроизводительНоменклатуры1С,
	|	ВТ_ДанныеНоменклатуры.СрокГодностиНоменклатуры1С КАК СрокГодностиНоменклатуры1С	
	|ИЗ
	|	ВТ_ДанныеМаркетплейса КАК ВТ_ДанныеМаркетплейса
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеНоменклатуры КАК ВТ_ДанныеНоменклатуры
	|		ПО (ВТ_ДанныеМаркетплейса.Номенклатура1С = ВТ_ДанныеНоменклатуры.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеЗаказаИРеализации КАК ВТ_ДанныеЗаказаИРеализации
	|		ПО (ВТ_ДанныеМаркетплейса.Заказ = ВТ_ДанныеЗаказаИРеализации.Заказ1С)
	//+ ИнфоСофт Заварин К.В. 27.12.24 УА #90269
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДанныеМаркетплейса.НомерЗаказаСМаркетплейса,
	|	ВТ_ДанныеМаркетплейса.Дата,
	|	ВТ_ДанныеМаркетплейса.КодНоменклатурыСМаркетплейса,
	|	ВТ_ДанныеМаркетплейса.АртикулПоставщикаНоменклатурыСМаркетплейса,
	|	ВТ_ДанныеМаркетплейса.РазмерСВБ,
	|	ВТ_ДанныеМаркетплейса.ЦветСВБ,
	|	ВТ_ДанныеМаркетплейса.ШтрихкодСМаркетплейса,
	|	ВТ_ДанныеМаркетплейса.НаименованиеНоменклатурыСМаркетплейса,
	|	ВТ_ДанныеМаркетплейса.Номенклатура1С,
	|	ВТ_ДанныеМаркетплейса.Характеристика1С,
	|	ВТ_ДанныеЗаказаИРеализации.Заказ1С,
	|	ВТ_ДанныеЗаказаИРеализации.ДатаЗаказ1С,
	|	ВТ_ДанныеЗаказаИРеализации.АвторЗаказ1С,
	|	ВТ_ДанныеЗаказаИРеализации.ОрганизацияЗаказ1С,
	|	ВТ_ДанныеЗаказаИРеализации.ОтветственныйЗаказ1С,
	|	ВТ_ДанныеЗаказаИРеализации.ДатаОтгрузкиЗаказ1С,
	|	ВТ_ДанныеЗаказаИРеализации.НомерЗаказ1С,
	|	ВТ_ДанныеНоменклатуры.НаименованиеНоменклатуры1С,
	|	ВТ_ДанныеНоменклатуры.АртикулНоменклатуры1С,
	|	ВТ_ДанныеНоменклатуры.ПроизводительНоменклатуры1С,
	|	ВТ_ДанныеНоменклатуры.СрокГодностиНоменклатуры1С,
	|	ВЫРАЗИТЬ(ВТ_ДанныеЗаказаИРеализации.КомментарийЗаказ1С КАК СТРОКА(1000))";
	//- ИнфоСофт Заварин К.В. 27.12.24 УА #90269

	Возврат Текст;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 29.10.2024 УА #67816

//+ ИнфоСофт Стояк Ю.К. 28.01.2025 УА #77168
Функция ПечатьЭтикеткиЗоныСборки(МассивОбъектов, ПараметрыПечати) Экспорт 
	
	КолонкаКодов = ФормированиеПечатныхФорм.ДополнительнаяКолонкаПечатныхФормДокументов().ИмяКолонки;	
	ВыводитьКоды = ЗначениеЗаполнено(КолонкаКодов); 	
	
	ТабличныйДокументОбщий = Новый ТабличныйДокумент;
	ТабличныйДокументОбщий.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ОтборРазмещениеТоваров_ЭтикеткаШК";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапросаЭтикетокЗоныСборки(ПараметрыПечати.СортироватьЯчейкиПо);
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);  
	
	УстановитьПривилегированныйРежим(Истина);
	
	Результаты = Запрос.ВыполнитьПакет();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Если ПараметрыПечати.СортироватьЯчейкиПо Тогда
		ВыборкаПоДокументам      = Результаты[0].Выбрать();
		ВыгрузкаПоТабличнымЧастям = Результаты[1].Выгрузить();
		ВыборкаПоРаспоряжениям   = Результаты[2].Выбрать();	
	Иначе
		ВыборкаПоДокументам      = Результаты[4].Выбрать();
		ВыгрузкаПоТабличнымЧастям = Результаты[2].Выгрузить();
		ВыборкаПоРаспоряжениям   = Результаты[3].Выбрать();
	КонецЕсли;
	
	РеквизитыДокумента = Новый Структура("Номер, Дата, Префикс, Представление");
		
	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_ИС_МП_ЭтикеткаЗоныСборки");
	ОбластьЗаголовок 		  = Макет.ПолучитьОбласть("Заголовок");
	ОбластьСкладИсполнитель   = Макет.ПолучитьОбласть("СкладИсполнитель");
	ОбластьОснование	 	  = Макет.ПолучитьОбласть("Основание");
	ОбластьРаспоряжение 	  = Макет.ПолучитьОбласть("Распоряжение");
	ОбластьЗаданиеНаПеревозку = Макет.ПолучитьОбласть("ЗаданиеНаПеревозку");
	ОбластьПодзаголовок 	  = Макет.ПолучитьОбласть("Подзаголовок");
	
	ОбластьШапкаТаблицыНачало 	= Макет.ПолучитьОбласть("ШапкаТаблицы|НачалоСтроки");
	ОбластьСтрокаТаблицыНачало 	= Макет.ПолучитьОбласть("СтрокаТаблицы|НачалоСтроки");
	ОбластьПодвалТаблицыНачало 	= Макет.ПолучитьОбласть("ПодвалТаблицы|НачалоСтроки");
	
	ОбластьШапкаТаблицыКолонкаКодов 	= Макет.ПолучитьОбласть("ШапкаТаблицы|КолонкаКодов");
	ОбластьСтрокаТаблицыКолонкаКодов 	= Макет.ПолучитьОбласть("СтрокаТаблицы|КолонкаКодов");
	ОбластьПодвалТаблицыКолонкаКодов 	= Макет.ПолучитьОбласть("ПодвалТаблицы|КолонкаКодов");
	
	Если НЕ ВыводитьКоды Тогда
		ОбластьКолонкаТоваров = Макет.Область("КолонкаТоваров");
		
		ОбластьКолонкаТоваров.ШиринаКолонки = ОбластьКолонкаТоваров.ШиринаКолонки  + Макет.Область("КолонкаКодов").ШиринаКолонки;
	КонецЕсли;	
	
	ОбластьШапкаТаблицыКолонкаТоваров 	= Макет.ПолучитьОбласть("ШапкаТаблицы|КолонкаТоваров");
	ОбластьСтрокаТаблицыКолонкаТоваров 	= Макет.ПолучитьОбласть("СтрокаТаблицы|КолонкаТоваров");
	ОбластьПодвалТаблицыКолонкаТоваров 	= Макет.ПолучитьОбласть("ПодвалТаблицы|КолонкаТоваров");
	
	ОбластьШапкаТаблицыКонец 	= Макет.ПолучитьОбласть("ШапкаТаблицы|КонецСтроки");
	ОбластьСтрокаТаблицыКонец 	= Макет.ПолучитьОбласть("СтрокаТаблицы|КонецСтроки");
	ОбластьПодвалТаблицыКонец 	= Макет.ПолучитьОбласть("ПодвалТаблицы|КонецСтроки");
	
	ПервыйДокумент = Истина;
	
	Пока ВыборкаПоДокументам.Следующий() Цикл 
		
		ТабличныйДокумент = Новый ТабличныйДокумент;
		
		НайденныеСтрокиТЧ = ВыгрузкаПоТабличнымЧастям.НайтиСтроки(Новый Структура("Ссылка",ВыборкаПоДокументам.Ссылка)); 
		Если Не НайденныеСтрокиТЧ.Количество() > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		ВыводитьОснование = Ложь;
		
		Если ВыборкаПоДокументам.ВидОперации = Перечисления.ВидыОперацийОтбораРазмещенияТоваров.Отбор Тогда
			
			ТекстЗаголовка		 = НСтр("ru='Задание на отбор товара'");
			ТекстЗоны			 = НСтр("ru='Зона отгрузки:'");
			ЗонаПредставление	 = ВыборкаПоДокументам.ЗонаОтгрузкиПредставление;
			РабочийУчасток		 = ВыборкаПоДокументам.РабочийУчастокПредставление;
			ВыводитьРаспоряжение = Истина;
			ВыводитьОснование    = ТипЗнч(ВыборкаПоДокументам.Распоряжение) = Тип("ДокументСсылка.РасходныйОрдерНаТовары");
			ВыводитьПодзаголовок = Ложь;
			
		ИначеЕсли ВыборкаПоДокументам.ВидОперации = Перечисления.ВидыОперацийОтбораРазмещенияТоваров.Размещение Тогда
			
			ТекстЗаголовка = НСтр("ru='Задание на размещение товара'");
			ТекстЗоны = НСтр("ru='Зона приемки:'");
			ЗонаПредставление = ВыборкаПоДокументам.ЗонаПриемкиПредставление;
			РабочийУчасток		= ВыборкаПоДокументам.РабочийУчастокПредставление;
			ВыводитьРаспоряжение = Ложь;
			ВыводитьПодзаголовок = Ложь;
			
		ИначеЕсли ВыборкаПоДокументам.ВидОперации = Перечисления.ВидыОперацийОтбораРазмещенияТоваров.Перемещение Тогда
			
			ТекстЗаголовка = НСтр("ru='Задание на перемещение товара'");
			ТекстЗоны = "";
			ЗонаПредставление = "";
			РабочийУчасток	= "";
			ВыводитьРаспоряжение = Ложь;
			ВыводитьПодзаголовок = Истина;
						
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(РеквизитыДокумента, ВыборкаПоДокументам);
		
		НомерДокумента = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ВыборкаПоДокументам.Ссылка.Номер);
		ОбластьЗаголовок.Параметры.ТекстЗаголовка = "Задание на отбор товара №" + НомерДокумента;
		ОбластьШтрихкода = Макет.ПолучитьОбласть("ОбластьШтрихкода|ОбластьШтрихкод");		
		ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабличныйДокумент, Макет, ОбластьШтрихкода, ВыборкаПоДокументам.Ссылка);
						
		ОбластьЗаголовокНомер = Макет.ПолучитьОбласть("ОбластьЗаголовокНомер");
		ОбластьЗаголовокНомер.Параметры.ТекстЗаголовка = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ВыборкаПоДокументам.Ссылка.Номер);		
				
		Если ВыводитьОснование Тогда
			
			Счетчик = 0;
			ПредставлениеОснований = "";
			ПервоеРаспоряжение = Истина;
			РеквизитыДокумента = Новый Структура("Дата, Номер, Префикс, Представление");
			
			Пока ВыборкаПоРаспоряжениям.НайтиСледующий(Новый Структура("Ссылка", ВыборкаПоДокументам.Ссылка)) Цикл
				зСсылка = Документы.ЗаказКлиента.НайтиПоНомеру(ВыборкаПоРаспоряжениям.ОснованиеНомер,ВыборкаПоРаспоряжениям.ОснованиеДата);
				Если типзнч(зСсылка.Ссылка) <> ТИП("ДокументСсылка.РеализацияТоваровУслуг")Тогда
				
									
						Запрос = Новый Запрос;
						Запрос.Текст = 
							"ВЫБРАТЬ
							|	РеализацияТоваровУслуг.Ссылка КАК рСсылка,
							|	ПРЕДСТАВЛЕНИЕ(РеализацияТоваровУслуг.Ссылка) КАК рПредставление,
							|	РеализацияТоваровУслуг.Номер КАК рНомер,
							|	РеализацияТоваровУслуг.Дата КАК рДата,
							|	РеализацияТоваровУслуг.АдресДоставки КАК АдресДоставки,
							|	РеализацияТоваровУслуг.Грузополучатель КАК Грузополучатель,
							|	РеализацияТоваровУслуг.ПеревозчикПартнер КАК ПеревозчикПартнер
							|ИЗ
							|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
							|ГДЕ
							|	РеализацияТоваровУслуг.ЗаказКлиента = &ЗаказКлиента
							|	И РеализацияТоваровУслуг.ПометкаУдаления = Ложь";
						
						Запрос.УстановитьПараметр("ЗаказКлиента",зСсылка);
						
						РезультатЗапроса = Запрос.Выполнить();
						
						ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
						
						Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
							рПредставление = ВыборкаДетальныеЗаписи.рПредставление;
							рНомер = ВыборкаДетальныеЗаписи.рНомер;
							рДата = ВыборкаДетальныеЗаписи.РДата;
							АдресДоставки = ВыборкаДетальныеЗаписи.АдресДоставки;
							Грузополучатель = ВыборкаДетальныеЗаписи.Грузополучатель;
							ПеревозчикПартнер = ВыборкаДетальныеЗаписи.ПеревозчикПартнер;
							РеализацияСсылка = ВыборкаДетальныеЗаписи.рСсылка;
						КонецЦикла;
						
						РеквизитыДокумента.Дата          = рДата;
						РеквизитыДокумента.Номер         = рНомер;
						РеквизитыДокумента.Префикс       = "";
						РеквизитыДокумента.Представление = рПредставление;
						
		 				ПредставлениеОснования = ОбщегоНазначенияУТКлиентСервер.СформироватьЗаголовокДокумента(РеквизитыДокумента);												
						
						НомерДокумента = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(рНомер);
						ОбластьЗаголовок.Параметры.ТекстЗаголовкаОснование = "Реализация товаров и услуг №" + НомерДокумента;
						ТабличныйДокумент.Вывести(ОбластьЗаголовок);						
						
						ОбластьМакетаШтрихкод = Макет.ПолучитьОбласть("ОбластьШтрихкода|ОбластьШтрихкодРТ");
						
						ОбластьМакета = ОбластьМакетаШтрихкод;
						ВыводитьШтрихкодВОтдельнуюОбласть = Истина;
						
						
						Эталон = Обработки.ПечатьЭтикетокИЦенников.ПолучитьМакет("Эталон");
						КоличествоМиллиметровВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;
						
						ПараметрыШтрихкода = Новый Структура;
						ПараметрыШтрихкода.Вставить("Ширина",           Окр(ОбластьМакета.Рисунки.КартинкаШтрихкодаРТ.Ширина / КоличествоМиллиметровВПикселе));
						ПараметрыШтрихкода.Вставить("Высота",           Окр(ОбластьМакета.Рисунки.КартинкаШтрихкодаРТ.Высота / КоличествоМиллиметровВПикселе));
						ПараметрыШтрихкода.Вставить("Штрихкод",         СокрЛП(ШтрихкодированиеПечатныхФорм.ЧисловойКодПоСсылке(РеализацияСсылка)));
						ПараметрыШтрихкода.Вставить("ТипВходныхДанных", 0); // Штрихкод - это строка
						ПараметрыШтрихкода.Вставить("ТипКода",          4); // Code128
						ПараметрыШтрихкода.Вставить("ОтображатьТекст",  Ложь);
						ПараметрыШтрихкода.Вставить("РазмерШрифта",     6);
						
						ОбластьМакета.Рисунки.КартинкаШтрихкодаРТ.Картинка = МенеджерОборудованияВызовСервера.ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода);
						
						ТабличныйДокумент.Вывести(ОбластьШтрихкода);
						
						Если ВыводитьШтрихкодВОтдельнуюОбласть Тогда
							ТабличныйДокумент.Присоединить(ОбластьМакета);
						КонецЕсли;						
						
                 Иначе
						РеквизитыДокумента.Дата          = ВыборкаПоРаспоряжениям.ОснованиеДата;
						РеквизитыДокумента.Номер         = ВыборкаПоРаспоряжениям.ОснованиеНомер;
						РеквизитыДокумента.Префикс       = "";
						РеквизитыДокумента.Представление = ВыборкаПоРаспоряжениям.ОснованиеПредставление;
						
		 				ПредставлениеОснования = ОбщегоНазначенияУТКлиентСервер.СформироватьЗаголовокДокумента(РеквизитыДокумента);
				 КонецЕсли;		
				Если Не ПервоеРаспоряжение Тогда
					ПредставлениеОснований = ПредставлениеОснований + ", ";		
				КонецЕсли;
				
				ПервоеРаспоряжение = Ложь;
				
				ПредставлениеОснований = ПредставлениеОснований + ПредставлениеОснования;
				
				Счетчик = Счетчик + 1;
				
			КонецЦикла;
	    
			ОснованияЗаголовок = "";
			Если Счетчик > 1 Тогда 
				ОснованияЗаголовок = НСтр("ru = 'Основания:'");
			Иначе
				ОснованияЗаголовок = НСтр("ru = 'Основание:'");
			КонецЕсли;
			
		Иначе
			ТабличныйДокумент.Вывести(ОбластьЗаголовок);
			ТабличныйДокумент.Вывести(ОбластьШтрихкода);
		КонецЕсли;
		
		Если ВыводитьРаспоряжение Тогда
			РеквизитыДокумента.Дата          = ВыборкаПоДокументам.РаспоряжениеДата;
			РеквизитыДокумента.Номер         = ВыборкаПоДокументам.РаспоряжениеНомер;
			РеквизитыДокумента.Префикс       = "";
			РеквизитыДокумента.Представление = ВыборкаПоДокументам.РаспоряжениеПредставление;						
			
			СвойствоМест = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("КоличествоМестПоДокументу");
			
		КонецЕсли;
		
		Если ВыборкаПоДокументам.ОтгрузкаПоЗаданиюНаПеревозку Тогда
			РеквизитыДокумента.Дата          = ВыборкаПоДокументам.ЗаданиеНаПеревозкуДата;
			РеквизитыДокумента.Номер         = ВыборкаПоДокументам.ЗаданиеНаПеревозкуНомер;
			РеквизитыДокумента.Префикс       = "";
			РеквизитыДокумента.Представление = ВыборкаПоДокументам.ЗаданиеНаПеревозкуПредставление;
		КонецЕсли;
		
		Метка = Неопределено;
		
		НомерСтроки = 1;
		
		Для Каждого СтрокаТЧ Из НайденныеСтрокиТЧ Цикл
			
			Если Метка <> СтрокаТЧ.Метка Тогда
				
				ВыводитьПодзаголовок = истина;

				Если ВыводитьПодзаголовок Тогда
					
					Если СтрокаТЧ.Метка = 0 Тогда
						ТекстПозаголовка = НСтр("ru='Товары к отбору'");
					Иначе
						ТекстПозаголовка = НСтр("ru='Товары к размещению'");
					КонецЕсли;
					Попытка
					  Если типзнч(зСсылка.Ссылка) <> ТИП("ДокументСсылка.РеализацияТоваровУслуг")Тогда

						СведенияОГрузополучателе  = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ВыборкаДетальныеЗаписи.Грузополучатель,  ВыборкаПоДокументам.Ссылка.Дата,, ВыборкаДетальныеЗаписи.рСсылка.БанковскийСчетГрузополучателя);

						ТекстПозаголовка         = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузополучателе, 
		                                            "ПолноеНаименование,ИНН,КПП,ФактическийАдрес,Телефоны");
					  Иначе 
						  
						СведенияОГрузополучателе  = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(зСсылка.Грузополучатель,  зСсылка.Дата, зСсылка.БанковскийСчетГрузополучателя);

						ТекстПозаголовка         = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузополучателе, 
		                                            "ПолноеНаименование,ИНН,КПП,ФактическийАдрес,Телефоны");
					  КонецЕсли;

					Исключение КонецПопытки;

					Если Метка <> Неопределено Тогда
						ТабличныйДокумент.Вывести(ОбластьПодвалТаблицыНачало);
						Если ВыводитьКоды Тогда
							ТабличныйДокумент.Присоединить(ОбластьПодвалТаблицыКолонкаКодов);
						КонецЕсли;
						ТабличныйДокумент.Присоединить(ОбластьПодвалТаблицыКолонкаТоваров);
						ТабличныйДокумент.Присоединить(ОбластьПодвалТаблицыКонец);
					КонецЕсли;
									
					ОбластьПодзаголовок.Параметры.ТекстПозаголовка = ТекстПозаголовка;
					ТабличныйДокумент.Вывести(ОбластьПодзаголовок);
				КонецЕсли;				
				
				ТабличныйДокумент.Вывести(ОбластьШапкаТаблицыНачало);
				Если ВыводитьКоды Тогда
					ТабличныйДокумент.Присоединить(ОбластьШапкаТаблицыКолонкаКодов);
				КонецЕсли;
				
				ТабличныйДокумент.Присоединить(ОбластьШапкаТаблицыКолонкаТоваров);
				ТабличныйДокумент.Присоединить(ОбластьШапкаТаблицыКонец); 
				
			КонецЕсли;
			
			ОбластьСтрокаТаблицыНачало.Параметры.Заполнить(СтрокаТЧ);
			ОбластьСтрокаТаблицыНачало.Параметры.НомерСтроки = НомерСтроки;
			НомерСтроки = НомерСтроки + 1;
			ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицыНачало);
			ОбластьСтрокаТаблицыКолонкаКодов.Параметры.Артикул = СтрокаТЧ[КолонкаКодов];

			Коммент = "";		
			ДопРек = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Складской комментарий",Истина);
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	НоменклатураДополнительныеРеквизиты.Значение КАК Значение
			|ИЗ
			|	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
			|ГДЕ
			|	НоменклатураДополнительныеРеквизиты.Ссылка = &Ссылка
			|	И НоменклатураДополнительныеРеквизиты.Свойство = &Свойство";
			
			Запрос.УстановитьПараметр("Свойство", ДопРек);
			Запрос.УстановитьПараметр("Ссылка", СтрокаТЧ.Номенклатура);
			ТабличныйДокумент.Присоединить(ОбластьСтрокаТаблицыКолонкаКодов);
			
			ОбластьСтрокаТаблицыКолонкаТоваров.Параметры.Товар = НоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(
			СтрокаТЧ.НоменклатураПредставление,
			СтрокаТЧ.ХарактеристикаПредставление,
			, 
			СтрокаТЧ.СерияПредставление);
			
			ТабличныйДокумент.Присоединить(ОбластьСтрокаТаблицыКолонкаТоваров);
			
			ОбластьСтрокаТаблицыКонец.Параметры.Заполнить(СтрокаТЧ);
			ТабличныйДокумент.Присоединить(ОбластьСтрокаТаблицыКонец);	
			
			Метка = СтрокаТЧ.Метка;
			
		КонецЦикла;
		
		ТабличныйДокумент.Вывести(ОбластьПодвалТаблицыНачало);
		Если ВыводитьКоды Тогда
			ТабличныйДокумент.Присоединить(ОбластьПодвалТаблицыКолонкаКодов);
		КонецЕсли;
		ТабличныйДокумент.Присоединить(ОбластьПодвалТаблицыКолонкаТоваров);
		ТабличныйДокумент.Присоединить(ОбластьПодвалТаблицыКонец);
		
		ОбъектыПечати = Новый СписокЗначений;
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаПоДокументам.Ссылка);
		
		ТабличныйДокумент.АвтоМасштаб = Истина;
		
		Если ПараметрыПечати.ВыводитьГоризонтальныйРазделитель Тогда
			ТабличныйДокументОбщий.Вывести(ТабличныйДокумент);
			ТабличныйДокументОбщий.ВывестиГоризонтальныйРазделительСтраниц();
		Иначе
			
			Если Не ПервыйДокумент Тогда
				
				Если Не ТабличныйДокументОбщий.ПроверитьВывод(ТабличныйДокумент) Тогда
					ТабличныйДокументОбщий.ВывестиГоризонтальныйРазделительСтраниц();
				КонецЕсли;
				
				ТабличныйДокументОбщий.Вывести(ТабличныйДокумент);
				
			Иначе
				ТабличныйДокументОбщий.Вывести(ТабличныйДокумент);
			КонецЕсли;     
			
		КонецЕсли;				
			
	КонецЦикла;
		
	ТабличныйДокументОбщий.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокументОбщий;	

КонецФункции //- ИнфоСофт Стояк Ю.К. 28.01.2025 УА #77168

//+ ИнфоСофт Стояк Ю.К. 10.02.2025 УА #77168
&НаСервере
Функция ПолучитьНастройкиПечатиЛистаПодбора(Профиль, МассивЗначений, Маркетплейс) Экспорт 
	
	НастройкиПечати = ИС_MP_Сервер.ПолучитьЗначениеНастроек(Профиль, Маркетплейс, МассивЗначений);
	
	Для Каждого Элемент Из МассивЗначений Цикл
		
		Если НастройкиПечати.Свойство(Элемент) И НастройкиПечати[Элемент] = Неопределено Тогда
			НастройкиПечати[Элемент] = Истина;
		ИначеЕсли Не НастройкиПечати.Свойство(Элемент) Тогда
			НастройкиПечати.Вставить(Элемент, Истина);
		КонецЕсли;				
	
	КонецЦикла;  
	
	Возврат НастройкиПечати;   
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 10.02.2025 УА #77168 

//+ ИнфоСофт Стояк Ю.К. 10.02.2025 УА #77168
&НаСервере
Процедура ЗаполнитьШапкуТаблицыЛистаПодбора(ТабДок, МакетОбработки, НастройкиПечати, МассивЗначений) Экспорт
	
	ОбластьВыведена = Ложь; 
	
	Для Каждого Параметр Из МассивЗначений Цикл
		
		Если НастройкиПечати[Параметр] Тогда
			
			ОбластьШапкаТаблицы = МакетОбработки.ПолучитьОбласть("ЗаголовокТаблицы|" + Сред(Параметр, 9));
			
			Если ОбластьВыведена Тогда
				ТабДок.Присоединить(ОбластьШапкаТаблицы);	
			Иначе
				ТабДок.Вывести(ОбластьШапкаТаблицы);	
				ОбластьВыведена = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат;
		
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 10.02.2025 УА #77168 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Стояк Ю.К. 28.01.2025 УА #77168
Функция ПолучитьТекстЗапросаЭтикетокЗоныСборки(СортировкаПоДокументу)

	Текст = 
	"ВЫБРАТЬ
	|	ОтборРазмещениеТоваров.Ссылка КАК Ссылка,
	|	ОтборРазмещениеТоваров.Дата КАК Дата,
	|	ОтборРазмещениеТоваров.Номер КАК Номер,
	|	ОтборРазмещениеТоваров.ВидОперации КАК ВидОперации,
	|	ПРЕДСТАВЛЕНИЕ(ОтборРазмещениеТоваров.ЗонаОтгрузки) КАК ЗонаОтгрузкиПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ОтборРазмещениеТоваров.ЗонаПриемки) КАК ЗонаПриемкиПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ОтборРазмещениеТоваров.РабочийУчасток) КАК РабочийУчастокПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ОтборРазмещениеТоваров.Склад) КАК СкладПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ОтборРазмещениеТоваров.Помещение) КАК ПомещениеПредставление,
	|	ОтборРазмещениеТоваров.Исполнитель.ФизическоеЛицо КАК Исполнитель,
	|	ОтборРазмещениеТоваров.Распоряжение КАК Распоряжение,
	|	ПРЕДСТАВЛЕНИЕ(ОтборРазмещениеТоваров.Распоряжение) КАК РаспоряжениеПредставление,
	|	ОтборРазмещениеТоваров.Распоряжение.Дата КАК РаспоряжениеДата,
	|	ОтборРазмещениеТоваров.Распоряжение.Номер КАК РаспоряжениеНомер,
	|	ЕСТЬNULL(ОтборРазмещениеТоваров.Распоряжение.ОтгрузкаПоЗаданиюНаПеревозку, ЛОЖЬ) КАК ОтгрузкаПоЗаданиюНаПеревозку,
	|	ОтборРазмещениеТоваров.Распоряжение.ПорядокДоставки КАК ПорядокДоставки,
	|	ПРЕДСТАВЛЕНИЕ(ОтборРазмещениеТоваров.Распоряжение.ЗаданиеНаПеревозку) КАК ЗаданиеНаПеревозкуПредставление,
	|	ОтборРазмещениеТоваров.Распоряжение.ЗаданиеНаПеревозку.Номер КАК ЗаданиеНаПеревозкуНомер,
	|	ОтборРазмещениеТоваров.Распоряжение.ЗаданиеНаПеревозку.Дата КАК ЗаданиеНаПеревозкуДата "
	+                                                                                          
	?(СортировкаПоДокументу, "", "ПОМЕСТИТЬ ВТ_Документы ")
	+
	"ИЗ
	|	Документ.ОтборРазмещениеТоваров КАК ОтборРазмещениеТоваров
	|ГДЕ
	|	ОтборРазмещениеТоваров.Ссылка В(&МассивОбъектов) "
	+
	?(СортировкаПоДокументу, "УПОРЯДОЧИТЬ ПО Ссылка ", "")
	+
	";
	|
	|////////////////////////////////////////////////////////////////////////////////
	|"
	+
	?(СортировкаПоДокументу, "", "ВЫБРАТЬ
	|	ОтборРазмещениеТоваровТоварыОтбор.НомерСтроки КАК НомерСтроки,
	|	0 КАК Метка,
	|	ОтборРазмещениеТоваровТоварыОтбор.КоличествоУпаковок КАК КоличествоПлан,
	|	ОтборРазмещениеТоваровТоварыОтбор.КоличествоУпаковокОтобрано КАК КоличествоФакт,
	|	ОтборРазмещениеТоваровТоварыОтбор.Номенклатура.НаименованиеПолное КАК НоменклатураПредставление,
	|	ОтборРазмещениеТоваровТоварыОтбор.Характеристика.НаименованиеПолное КАК ХарактеристикаПредставление,
	|	ОтборРазмещениеТоваровТоварыОтбор.Серия.Наименование КАК СерияПредставление,
	|	ОтборРазмещениеТоваровТоварыОтбор.Ячейка.Наименование КАК ЯчейкаПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ОтборРазмещениеТоваровТоварыОтбор.Упаковка) КАК УпаковкаПредставление,
	|	ОтборРазмещениеТоваровТоварыОтбор.Номенклатура.Код КАК Код,
	|	ОтборРазмещениеТоваровТоварыОтбор.Номенклатура.Артикул КАК Артикул,
	|	ОтборРазмещениеТоваровТоварыОтбор.Ссылка КАК Ссылка,
	|	ОтборРазмещениеТоваровТоварыОтбор.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТ_Ячейки
	|ИЗ
	|	Документ.ОтборРазмещениеТоваров.ТоварыОтбор КАК ОтборРазмещениеТоваровТоварыОтбор
	|ГДЕ
	|	ОтборРазмещениеТоваровТоварыОтбор.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОтборРазмещениеТоваровТоварыРазмещение.НомерСтроки,
	|	1,
	|	ОтборРазмещениеТоваровТоварыРазмещение.КоличествоУпаковок,
	|	ОтборРазмещениеТоваровТоварыРазмещение.КоличествоУпаковокРазмещено,
	|	ОтборРазмещениеТоваровТоварыРазмещение.Номенклатура.НаименованиеПолное,
	|	ОтборРазмещениеТоваровТоварыРазмещение.Характеристика.НаименованиеПолное,
	|	ПРЕДСТАВЛЕНИЕ(ОтборРазмещениеТоваровТоварыРазмещение.Серия),
	|	ОтборРазмещениеТоваровТоварыРазмещение.Ячейка.Наименование,
	|	ПРЕДСТАВЛЕНИЕ(ОтборРазмещениеТоваровТоварыРазмещение.Упаковка),
	|	ОтборРазмещениеТоваровТоварыРазмещение.Номенклатура.Код,
	|	ОтборРазмещениеТоваровТоварыРазмещение.Номенклатура.Артикул,
	|	ОтборРазмещениеТоваровТоварыРазмещение.Ссылка,
	|	NULL
	|ИЗ
	|	Документ.ОтборРазмещениеТоваров.ТоварыРазмещение КАК ОтборРазмещениеТоваровТоварыРазмещение
	|ГДЕ
	|	ОтборРазмещениеТоваровТоварыРазмещение.Ссылка В(&МассивОбъектов)
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////// 
	|")	
	+
	"ВЫБРАТЬ
	|	ОтборРазмещениеТоваровТоварыОтбор.НомерСтроки КАК НомерСтроки,
	|	0 КАК Метка,
	|	ОтборРазмещениеТоваровТоварыОтбор.КоличествоУпаковок КАК КоличествоПлан,
	|	ОтборРазмещениеТоваровТоварыОтбор.КоличествоУпаковокОтобрано КАК КоличествоФакт,
	|	ОтборРазмещениеТоваровТоварыОтбор.Номенклатура.НаименованиеПолное КАК НоменклатураПредставление,
	|	ОтборРазмещениеТоваровТоварыОтбор.Характеристика.НаименованиеПолное КАК ХарактеристикаПредставление,
	|	ОтборРазмещениеТоваровТоварыОтбор.Серия.Наименование КАК СерияПредставление,
	|	ОтборРазмещениеТоваровТоварыОтбор.Ячейка.Наименование КАК ЯчейкаПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ОтборРазмещениеТоваровТоварыОтбор.Упаковка) КАК УпаковкаПредставление,
	|	ОтборРазмещениеТоваровТоварыОтбор.Номенклатура.Код КАК Код,
	|	ОтборРазмещениеТоваровТоварыОтбор.Номенклатура.Артикул КАК Артикул,
	|	ОтборРазмещениеТоваровТоварыОтбор.Ссылка КАК Ссылка,
	|	ОтборРазмещениеТоваровТоварыОтбор.Номенклатура КАК Номенклатура
	|ИЗ
	|	Документ.ОтборРазмещениеТоваров.ТоварыОтбор КАК ОтборРазмещениеТоваровТоварыОтбор
	|ГДЕ
	|	ОтборРазмещениеТоваровТоварыОтбор.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОтборРазмещениеТоваровТоварыРазмещение.НомерСтроки,
	|	1,
	|	ОтборРазмещениеТоваровТоварыРазмещение.КоличествоУпаковок,
	|	ОтборРазмещениеТоваровТоварыРазмещение.КоличествоУпаковокРазмещено,
	|	ОтборРазмещениеТоваровТоварыРазмещение.Номенклатура.НаименованиеПолное,
	|	ОтборРазмещениеТоваровТоварыРазмещение.Характеристика.НаименованиеПолное,
	|	ПРЕДСТАВЛЕНИЕ(ОтборРазмещениеТоваровТоварыРазмещение.Серия),
	|	ОтборРазмещениеТоваровТоварыРазмещение.Ячейка.Наименование,
	|	ПРЕДСТАВЛЕНИЕ(ОтборРазмещениеТоваровТоварыРазмещение.Упаковка),
	|	ОтборРазмещениеТоваровТоварыРазмещение.Номенклатура.Код,
	|	ОтборРазмещениеТоваровТоварыРазмещение.Номенклатура.Артикул,
	|	ОтборРазмещениеТоваровТоварыРазмещение.Ссылка,
	|	NULL
	|ИЗ
	|	Документ.ОтборРазмещениеТоваров.ТоварыРазмещение КАК ОтборРазмещениеТоваровТоварыРазмещение
	|ГДЕ
	|	ОтборРазмещениеТоваровТоварыРазмещение.Ссылка В(&МассивОбъектов)
	| "
	+ 
	?(СортировкаПоДокументу, 
	"УПОРЯДОЧИТЬ ПО	
	|	Ссылка,	
	|	Метка,	
	|	ЯчейкаПредставление
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОтборРазмещениеТоваров.Ссылка КАК Ссылка,
	|	ПРЕДСТАВЛЕНИЕ(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение) КАК ОснованиеПредставление,
	|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение.Номер КАК ОснованиеНомер,
	|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение.Дата КАК ОснованиеДата,
	|	МИНИМУМ(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.НомерСтроки) КАК НомерСтроки
	|ИЗ
	|	Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтборРазмещениеТоваров КАК ОтборРазмещениеТоваров
	|		ПО РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка = ОтборРазмещениеТоваров.Распоряжение
	|ГДЕ
	|	ОтборРазмещениеТоваров.Ссылка В(&МассивОбъектов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтборРазмещениеТоваров.Ссылка,
	|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение.Номер,
	|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение.Дата,
	|	ПРЕДСТАВЛЕНИЕ(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки", 	
	"УПОРЯДОЧИТЬ ПО	
	|	ЯчейкаПредставление,
	|	Ссылка	
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОтборРазмещениеТоваров.Ссылка КАК Ссылка,
	|	ПРЕДСТАВЛЕНИЕ(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение) КАК ОснованиеПредставление,
	|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение.Номер КАК ОснованиеНомер,
	|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение.Дата КАК ОснованиеДата,
	|	МИНИМУМ(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.НомерСтроки) КАК НомерСтроки,
	|	ВТ_Ячейки.ЯчейкаПредставление КАК ЯчейкаПредставление
	|ИЗ
	|	Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтборРазмещениеТоваров КАК ОтборРазмещениеТоваров
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Ячейки КАК ВТ_Ячейки
	|			ПО (ОтборРазмещениеТоваров.Ссылка = ВТ_Ячейки.Ссылка)
	|		ПО (РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка = ОтборРазмещениеТоваров.Распоряжение)
	|ГДЕ
	|	ОтборРазмещениеТоваров.Ссылка В(&МассивОбъектов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтборРазмещениеТоваров.Ссылка,
	|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение.Номер,
	|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение.Дата,
	|	ВТ_Ячейки.ЯчейкаПредставление,
	|	ПРЕДСТАВЛЕНИЕ(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЯчейкаПредставление,
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Документы.Ссылка КАК Ссылка,
	|	ВТ_Документы.Дата КАК Дата,
	|	ВТ_Документы.Номер КАК Номер,
	|	ВТ_Документы.ВидОперации КАК ВидОперации,
	|	ВТ_Документы.ЗонаОтгрузкиПредставление КАК ЗонаОтгрузкиПредставление,
	|	ВТ_Документы.ЗонаПриемкиПредставление КАК ЗонаПриемкиПредставление,
	|	ВТ_Документы.РабочийУчастокПредставление КАК РабочийУчастокПредставление,
	|	ВТ_Документы.СкладПредставление КАК СкладПредставление,
	|	ВТ_Документы.ПомещениеПредставление КАК ПомещениеПредставление,
	|	ВТ_Документы.Исполнитель КАК Исполнитель,
	|	ВТ_Документы.Распоряжение КАК Распоряжение,
	|	ВТ_Документы.РаспоряжениеПредставление КАК РаспоряжениеПредставление,
	|	ВТ_Документы.РаспоряжениеДата КАК РаспоряжениеДата,
	|	ВТ_Документы.РаспоряжениеНомер КАК РаспоряжениеНомер,
	|	ВТ_Документы.ОтгрузкаПоЗаданиюНаПеревозку КАК ОтгрузкаПоЗаданиюНаПеревозку,
	|	ВТ_Документы.ПорядокДоставки КАК ПорядокДоставки,
	|	ВТ_Документы.ЗаданиеНаПеревозкуПредставление КАК ЗаданиеНаПеревозкуПредставление,
	|	ВТ_Документы.ЗаданиеНаПеревозкуНомер КАК ЗаданиеНаПеревозкуНомер,
	|	ВТ_Документы.ЗаданиеНаПеревозкуДата КАК ЗаданиеНаПеревозкуДата,
	|	ВТ_Ячейки.ЯчейкаПредставление КАК ЯчейкаПредставление
	|ИЗ
	|	ВТ_Документы КАК ВТ_Документы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Ячейки КАК ВТ_Ячейки
	|		ПО (ВТ_Документы.Ссылка = ВТ_Ячейки.Ссылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЯчейкаПредставление,
	|	Ссылка");
		
	Возврат Текст;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 28.01.2025 УА #77168

#КонецОбласти
